# Дан список:
# ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

# Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
# (добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём
# до двух целочисленных разрядов:
# ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']

# Сформировать из обработанного списка строку:
# в "05" часов "17" минут температура воздуха была "+05" градусов

# Подумать, какое условие записать, чтобы выявить числа среди элементов списка?
# Как модифицировать это условие для чисел со знаком?

arr = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
for i in range(len(arr)):
    count_num = 0
    count = 0
    for j in arr[i]:
        count += 1
        if 48 <= ord(j) <= 57:
            count_num += 1
    if count_num == 1:
        _ = arr[i][:count - 1] + '0' + arr[i][count - 1:]
        arr[i] = _
    if count_num > 0:
        _ = '"' + arr[i] + '"'
        arr[i] = _

print(' '.join(arr))